<?php
return [
    'core_min_php_version' => 'Версия PHP не удовлетворяет минимальным требованиям<br>Текущая версия PHP: %s<br>Минимальная версия PHP должна быть не ниже: %s',
    'session_disabled' => 'Функция сессий отключена',
    'session_start_error' => 'Не удалось запустить сессию',
    'db_not_connect' => 'Не удалось установить соединение с сервером БД',
    'db_sql_error' => 'Не корректный запрос',
    'products_not_found_list' => 'Не удалось получить список товаров',
    'products_not_found_product' => 'Не удалось получить данные товара',
    'categories_not_found_list' => 'Не удалось получить список категорий',
    'categories_not_found' => 'Не удалось получить данные категории',
    'cart_not_found_products' => 'Не удалось получить список товаров в корзине',
    'users_not_found_list' => 'Не удалось получить список пользователей',
    'users_not_found_data' => 'Не удалось получить данные пользователя',
    'page_not_found' => 'Ошибка 404! Страница не найдена',
    'db_not_found_config' => 'Не удалось найти конфигурациооный файл подключения к базе данных',
    'db_query_execution_failed' => 'Не удалось выполнить запрос',
    'db_unknown_parameter_type' => 'Неизвестный тип параметра в запросе'
];
